Examinator/src/Documents/ЗаявкаНаОбучениеСУО/ЗаявкаНаОбучениеСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкаНаОбучениеСУО</name>
  <registerRecords>InformationRegister.ЗаявкиНаОбучениеСУО</registerRecords>
  <attributes>
    <name>ОбъектЗаявки</name>
    <type>
      <types>CatalogRef.КаталогМероприятийСУО</types>
      <types>CatalogRef.КаталогПрограммОбученияСУО</types>
      <types>CatalogRef.СводыЗнанийСУЗ</types>
      <types>DocumentRef.ПроведениеПрограммыОбученияСУО</types>
      <types>DocumentRef.ПроведениеОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредметЗаявки</name>
    <type>
      <types>DocumentRef.ПроведениеПрограммыОбученияСУО</types>
      <types>DocumentRef.ПроведениеОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Информация</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыЗаявокНаОбучениеСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Прохождение</name>
    <type>
      <types>DocumentRef.ПрохождениеПрограммыОбученияСУО</types>
      <types>DocumentRef.ПрохождениеОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРассмотрения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Анкета</name>
    <type>
      <types>DocumentRef.Анкета</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Участники</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Прохождение</name>
      <type>
        <types>DocumentRef.ПрохождениеПрограммыОбученияСУО</types>
        <types>DocumentRef.ПрохождениеОбученияСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Examinator/src/Enums/СтатусыЗаявокНаОбучениеСУО/СтатусыЗаявокНаОбучениеСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЗаявокНаОбучениеСУО</name>
  <enumValues>
    <name>НаРассмотрении</name>
  </enumValues>
  <enumValues>
    <name>Утверждена</name>
  </enumValues>
  <enumValues>
    <name>Отклонена</name>
  </enumValues>
  <enumValues>
    <name>Отменена</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Documents/ЗаявкаНаОбучениеСУО/Forms/ФормаДокумента/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаСервереБезКонтекста
Функция ЗачислитьУчастника(ПредметЗаявки, ОбъектЗаявки, Пользователь, Заявка)
	
	Если ТипЗнч(ПредметЗаявки) = Тип("ДокументСсылка.ПроведениеОбученияСУО") Тогда		
		Возврат УправлениеОбучениемСУО.ЗачислитьУчастникаНаОбучение(ПредметЗаявки, ОбъектЗаявки, Пользователь,,,Заявка);		
	КонецЕсли;
	
	Если ТипЗнч(ПредметЗаявки) = Тип("ДокументСсылка.ПроведениеПрограммыОбученияСУО") Тогда		
		Возврат УправлениеОбучениемСУО.ЗачислитьУчастникаНаПрограммуОбучения(ПредметЗаявки, Пользователь,,Заявка);		
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ЗачислитьУчастников()
	
	НачатьТранзакцию();
	
	Для каждого Строка Из Объект.Участники Цикл
	
		Если НЕ ЗначениеЗаполнено(Строка.Прохождение) Тогда
			Строка.Прохождение = ЗачислитьУчастника(Объект.ПредметЗаявки, Объект.ОбъектЗаявки, Строка.Пользователь, Объект.Ссылка);
		КонецЕсли;
	
	КонецЦикла;
	
	Объект.Статус           = Перечисления.СтатусыЗаявокНаОбучениеСУО.Утверждена;
	Объект.ДатаРассмотрения = ТекущаяДата();
	
	РежимЗаписи = Новый Структура();
	РежимЗаписи.Вставить("РежимЗаписи", РежимЗаписиДокумента.Проведение);
	Записать(РежимЗаписи);
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьКоманд()
	
	Если Объект.Статус = Перечисления.СтатусыЗаявокНаОбучениеСУО.НаРассмотрении
		ИЛИ Объект.Статус = Перечисления.СтатусыЗаявокНаОбучениеСУО.Отклонена
		ИЛИ Объект.Статус = Перечисления.СтатусыЗаявокНаОбучениеСУО.Отменена Тогда
		
		Элементы.ГруппаУтверждение.Доступность = Истина;
		
	Иначе
		
		Элементы.ГруппаУтверждение.Доступность = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		Отказ = Истина; // Объект создается интерактивно только в форме "ФормаПодачиЗаявки"
	КонецЕсли;
	
	ТипОбъектаЗаявки = Документы.ЗаявкаНаОбучениеСУО.ТипОбъектаЗаявки(Объект.ОбъектЗаявки);
	
	Если НЕ ЗначениеЗаполнено(Объект.Анкета) Тогда
		Элементы.Анкета.Видимость = Ложь;
	КонецЕсли;
	
	ЕстьПравоУтвержденияЗаявки = УправлениеДоступом.ЕстьРоль("УправлениеПроведениемОбученияСУО");
	
	Если НЕ ЕстьПравоУтвержденияЗаявки Тогда
		Элементы.ГруппаУтверждение.Видимость = Ложь;
		Элементы.Комментарий.ТолькоПросмотр  = Истина;
	КонецЕсли;
	
	Если Объект.Пользователь = Пользователи.ТекущийПользователь() Тогда
		Элементы.Информация.ТолькоПросмотр = Ложь;
	Иначе
		Элементы.Информация.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ПредметЗаявки)
		И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ПредметЗаявки, "ОткрытоДляРуководителей") Тогда
		
		Элементы.Участники.Видимость = Истина;
		
	Иначе
		
		Элементы.Участники.Видимость = Ложь;
		
	КонецЕсли;
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства

	УстановитьДоступностьКоманд();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	УстановитьДоступностьКоманд();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)	
	// СтандартныеПодсистемы.Свойства 
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
	    ОбновитьЭлементыДополнительныхРеквизитов();
	    УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНД

&НаКлиенте
Процедура Утвердить(Команда)
	
	Если Объект.Участники.Количество() > 0 Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("УтвердитьПользователейПродолжение", ЭтотОбъект);		
		Текст = НСтр("ru = 'Записать пользователей из списка на мероприятие?'");
		
		ПоказатьВопрос(ОписаниеОповещения, Текст, РежимДиалогаВопрос.ДаНет, 0);
		
	Иначе
		
		Если ЗначениеЗаполнено(Объект.Прохождение) Тогда
			
			УтвердитьПользователя();
			
		Иначе
			
			Режим = РежимДиалогаВопрос.ДаНет;
			Текст = НСтр("ru = 'Записать пользователя %1 на мероприятие?'");
			Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Текст, Объект.Пользователь);
			ОписаниеОповещения = Новый ОписаниеОповещения("ЗаписатьПользователяПродолжение", ЭтотОбъект);		
				
			ПоказатьВопрос(ОписаниеОповещения, Текст, Режим, 0);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УтвердитьПользователейПродолжение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ЗачислитьУчастников();
	
КонецПроцедуры	

&НаКлиенте
Процедура ЗаписатьПользователяПродолжение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	Объект.Прохождение = ЗачислитьУчастника(Объект.ПредметЗаявки, Объект.ОбъектЗаявки, Объект.Пользователь, Объект.Ссылка);
	
	УтвердитьПользователя();
	
КонецПроцедуры

&НаКлиенте
Процедура УтвердитьПользователя() Экспорт
	
	Объект.Статус  = ПредопределенноеЗначение("Перечисление.СтатусыЗаявокНаОбучениеСУО.Утверждена");
		
	Объект.ДатаРассмотрения = ТекущаяДата();
	
	РежимЗаписи = Новый Структура();
	РежимЗаписи.Вставить("РежимЗаписи", РежимЗаписиДокумента.Проведение);
	Записать(РежимЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура Отклонить(Команда)
	
	Объект.Статус  = ПредопределенноеЗначение("Перечисление.СтатусыЗаявокНаОбучениеСУО.Отклонена");
	
	Объект.ДатаРассмотрения = ТекущаяДата();
	
	РежимЗаписи = Новый Структура();
	РежимЗаписи.Вставить("РежимЗаписи", РежимЗаписиДокумента.Проведение);
	Записать(РежимЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура Отменить(Команда)
	
	Объект.Статус  = ПредопределенноеЗначение("Перечисление.СтатусыЗаявокНаОбучениеСУО.Отменена");
	
	Объект.ДатаРассмотрения = ТекущаяДата();
	
	РежимЗаписи = Новый Структура();
	РежимЗаписи.Вставить("РежимЗаписи", РежимЗаписиДокумента.Проведение);
	Записать(РежимЗаписи);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ОбъектЗаявкиОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОбъектыСУЗКлиент.РедактироватьЭлектронныйРесурс(Объект.ОбъектЗаявки);

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ПОДСИСТЕМЫ СВОЙСТВ

// СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
    УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
    УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
КонецПроцедуры


// Конец СтандартныеПодсистемы.Свойства
